Австралия/src/Catalogs/ProjectTemplates/ProjectTemplates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProjectTemplates</name>
  <attributes>
    <name>DurationUnit</name>
    <type>
      <types>EnumRef.DurationUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkSchedule</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>CalculationStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>PhasesTemplates</name>
    <attributes>
      <name>Code</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>StartDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Duration</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EndDate</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Parent</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Previous</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsProduction</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/ProjectPhasesTimelines/ProjectPhasesTimelines.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ProjectPhasesTimelines</name>
  <resources>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>EndDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>DurationUnit</name>
    <type>
      <types>EnumRef.DurationUnits</types>
    </type>
  </resources>
  <resources>
    <name>ActualStartDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ActualEndDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ActualDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ActualDurationUnit</name>
    <type>
      <types>EnumRef.DurationUnits</types>
    </type>
  </resources>
  <dimensions>
    <name>ProjectPhase</name>
    <type>
      <types>CatalogRef.ProjectPhases</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Catalogs/Projects/Projects.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Projects</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>CatalogRef.FixedAssets</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProjectStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WorkSchedule</name>
    <type>
      <types>CatalogRef.Calendars</types>
    </type>
  </attributes>
  <attributes>
    <name>ActualStartDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ActualEndDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DurationUnit</name>
    <type>
      <types>EnumRef.DurationUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>UseWorkSchedule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CalculateDeadlinesAutomatically</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>FinancialDocumentsSetting</name>
    <attributes>
      <name>DocumentType</name>
      <type>
        <types>CatalogRef.MetadataObjectIDs</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Catalogs/ProjectPhases/ProjectPhases.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ProjectPhases</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Projects</owners>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProjectPhaseStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>IsProduction</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductionOrder</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Executor</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>PreviousPhase</name>
    <type>
      <types>CatalogRef.ProjectPhases</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeWBS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PhaseNumberInLevel</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SummaryPhase</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/ProjectTemplates/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("CatalogRef.Projects") Then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	Projects.WorkSchedule AS WorkSchedule,
		|	Projects.DurationUnit AS DurationUnit
		|FROM
		|	Catalog.Projects AS Projects
		|WHERE
		|	Projects.Ref = &Ref
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	ProjectPhases.Description AS Description,
		|	ProjectPhases.IsProduction AS IsProduction,
		|	ProjectPhases.CodeWBS AS Code,
		|	ISNULL(PreviousPhases.CodeWBS, """") AS Previous,
		|	ISNULL(ParentPhases.CodeWBS, """") AS Parent,
		|	ISNULL(ProjectPhasesTimelines.StartDate, DATETIME(1, 1, 1)) AS StartDate,
		|	ISNULL(ProjectPhasesTimelines.Duration, 0) AS Duration,
		|	ISNULL(ProjectPhasesTimelines.EndDate, DATETIME(1, 1, 1)) AS EndDate
		|FROM
		|	Catalog.ProjectPhases AS ProjectPhases
		|		LEFT JOIN InformationRegister.ProjectPhasesTimelines AS ProjectPhasesTimelines
		|		ON (ProjectPhasesTimelines.ProjectPhase = ProjectPhases.Ref)
		|		LEFT JOIN Catalog.ProjectPhases AS ParentPhases
		|		ON ProjectPhases.Parent = ParentPhases.Ref
		|		LEFT JOIN Catalog.ProjectPhases AS PreviousPhases
		|		ON ProjectPhases.PreviousPhase = PreviousPhases.Ref
		|WHERE
		|	ProjectPhases.Owner = &Ref
		|	AND NOT ProjectPhases.DeletionMark
		|
		|ORDER BY
		|	ProjectPhases.PhaseNumberInLevel HIERARCHY";
		
		Query.SetParameter("Ref", FillingData);
		
		QueryResult = Query.ExecuteBatch();
		
		Header = QueryResult[0].Unload();
		If Header.Count() > 0 Then
			DurationUnit = Header[0].DurationUnit;
			WorkSchedule = Header[0].WorkSchedule;
		EndIf;
		
		TabSection = QueryResult[1].Unload();
		If TabSection.Count() > 0 Then
			
			PhasesTemplates.Load(TabSection);
			
			TabSection.Sort("StartDate");
			CalculationStartDate = TabSection[0].StartDate;
			
		EndIf;
		
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
